In [1]:
from google.cloud import bigquery
from bq_guard import safe_query

client = bigquery.Client()

sql = """
SELECT name, SUM(number) AS total
FROM `bigquery-public-data.usa_names.usa_1910_current`
GROUP BY name
ORDER BY total DESC
LIMIT 1000
"""

# выполнит dry-run + проверку лимитов и только потом — реальный запрос
df = safe_query(client, sql, location="US", regions=["region-us"])
df.head()

Storage 0.00/10 GB, Trafik 0.000/1 TB

      name    total
0    James  5054074
1     John  4910976
2   Robert  4763102
3  Michael  4396482
4  William  3939912